# IsValidConduitType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Conduit..::..IsValidConduitType Method
Conduit Class See Also
---
Identifies if a conduit type is valid.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsValidConduitType(
	Document document,
	ElementId conduitType
)
```

Visual Basic
---
```text
Public Shared Function IsValidConduitType ( _
	document As Document, _
	conduitType As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidConduitType(
	Document^ document,
	ElementId^ conduitType
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
conduitType
    Type: Autodesk.Revit.DB..::..ElementId The conduit type.
# ### Return Value
True if the conduit type is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Conduit Class
Autodesk.Revit.DB.Electrical Namespace